---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.InternalOrigin
source: html/6774a744-315e-784a-209e-fa097d1cc068.htm
---
# InternalOrigin Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.